app/views/brews/index.html.erb

SELECT "brews".* FROM "brews"
---

  var zips = <%= @brews.map{ |brew| brew.brewer.zip } %>;