app/views/brews/show.html.erb

  <b>Brewer:</b>
  <%= Brewer.find(@brew.brewer_id).name %>
---
SELECT "brewers".* FROM "brewers" WHERE "brewers"."id" = ? LIMIT 1  [["id", 1]]
SELECT "brews".* FROM "brews" WHERE "brews"."id" = ? LIMIT 1  [["id", "1"]]