app/controllers/brewers_controller.rb

  def index
    @brewers = Brewer.all
---
SELECT "brewers".* FROM "brewers"

  def show
    @brewer = Brewer.find(params[:id])
---
SELECT "brewers".* FROM "brewers" WHERE "brewers"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @brewer = Brewer.find(params[:id])
---
SELECT "brewers".* FROM "brewers" WHERE "brewers"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @brewer = Brewer.new(params[:brewer])

    respond_to do |format|
      if @brewer.save
---
INSERT INTO "brewers" ("created_at", "email", "name", "password_digest", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 30 Jan 2014 03:02:34 UTC +00:00], ["email", nil], ["name", "David"], ["password_digest", nil], ["updated_at", Thu, 30 Jan 2014 03:02:34 UTC +00:00], ["zip", 80302]]

  def destroy
    @brewer = Brewer.find(params[:id])
    @brewer.destroy
---
SELECT "brewers".* FROM "brewers" WHERE "brewers"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "brewers" WHERE "brewers"."id" = ?  [["id", 2]]