app/controllers/brews_controller.rb

SELECT "brews".* FROM "brews"
---
  def index
    @brews = Brew.all

SELECT "brews".* FROM "brews" WHERE "brews"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @brew = Brew.find(params[:id])

INSERT INTO "brews" ("abv", "brewer_id", "created_at", "description", "ibu", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["abv", nil], ["brewer_id", 1], ["created_at", Thu, 30 Jan 2014 03:06:21 UTC +00:00], ["description", "blah"], ["ibu", nil], ["name", "mybre"], ["updated_at", Thu, 30 Jan 2014 03:06:21 UTC +00:00]]
---
  def create
    @brew = Brew.new(params[:brew])

    respond_to do |format|
      if @brew.save